benchmark/benchmark-result-2025-12-26/sleep_1ms/keep-alive/cl-tbnl-gserver-tmgr_threads-8-default.log
cl-tbnl-gserver-tmgr_threads-8-default.log
CL-TBNL-GSERVER-TMGR	0.1.1

LISP-IMPLEMENTATION-TYPE   	SBCL                               
LISP-IMPLEMENTATION-VERSION	2.2.9.debian                       
MACHINE-TYPE               	X86-64                             
MACHINE-VERSION            	13th Gen Intel(R) Core(TM) i7-1360P
SOFTWARE-TYPE              	Linux                              
SOFTWARE-VERSION           	5.15.153.1-microsoft-standard-WSL2 
*handler-sleep-seconds*	0.001

# -t 4 -c 100 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.38ms  179.38us   8.57ms   89.55%
    Req/Sec     2.86k     1.44k    4.73k    55.50%
  56924 requests in 10.08s, 7.98MB read
Requests/sec:   5644.48
Transfer/sec:    810.29KB

# -t 4 -c 10 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.39ms  207.34us  15.82ms   95.21%
    Req/Sec     0.96k   341.59     1.61k    67.00%
  28586 requests in 10.03s, 4.01MB read
Requests/sec:   2849.79
Transfer/sec:    409.10KB

# -t 16 -c 400 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.40ms  256.22us   9.71ms   85.70%
    Req/Sec     5.62k   663.90     6.44k    58.82%
  57036 requests in 10.07s, 8.00MB read
Requests/sec:   5663.03
Transfer/sec:    812.96KB